lgstoian/p4minishell/test/sdkconfig.defaults
# Unit-test project configuration.
#
# The tests link the real shell, command, networking, and UI components, so
# this file must keep the build-affecting options in sync with the firmware's
# sdkconfig.defaults. Only options the components depend on at compile time
# are duplicated here; the tests do not need the flash, PSRAM, or radio
# tuning that the firmware image requires.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# The whole unit suite runs on the app main task; the calc evaluator and the
# editor document tests are recursive, so give it a comfortable stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PM_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ESP-Hosted on ESP32-P4 with ESP32-C6 co-processor over SDIO.
# Required so components/networking compiles the hosted Wi-Fi path.
CONFIG_ESP_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_HOST=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_HOST_SDIO_SLOT=1
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ALWAYS=y

# Hosted NimBLE Bluetooth, required by components/networking/bluetooth.c.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_HOST_FEAT_BT=y

# FATFS long file names. components/command uses FILINFO.altname for the
# short-name column in `dir`, which only exists when LFN is enabled.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_LABEL=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# USB host defaults required by the local usb component override.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
CONFIG_USB_HOST_RESET_HOLD_MS=30
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
CONFIG_USB_HOST_RESUME_HOLD_MS=30
CONFIG_USB_HOST_RESUME_RECOVERY_MS=20
CONFIG_USB_HOST_SUSPEND_ENTRY_MS=20
CONFIG_USB_OTG_SUPPORTED=y

# LVGL features used by components/command (screenshot) and components/windows
# (coloured transcript span group). command.c calls lv_snapshot_take_to_draw_buf
# and windows.c builds an lv_spangroup, so both must be compiled in for the
# test project to link the shared components.
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_SPAN=y
